tutorialsDyM/1DAvalancheMuI/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * sediment properties * * * * * * * * * * * * //
phasea
{
    rho             rho [ 1 -3 0 0 0 ] 1;
    nu              nu [ 0 2 -1 0 0 ] 1e-6;
    d               d [ 0 1 0 0 0 0 0 ] 0.02;
}

phaseb
{
    rho             rho [ 1 -3 0 0 0 ] 1e-1;
    nu              nu [ 0 2 -1 0 0 ] 1e-1;
    d               d [ 0 1 0 0 0 0 0 ] 1;
}
//*********************************************************************** //
transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] 1e-1;

// Diffusivity for mass conservation resolution (avoid num instab around shocks)
alphaDiffusion  alphaDiffusion [0 2 -1 0 0 0 0] 0e0;

nuMax           nuMax [0 2 -1 0 0 0 0] 1e5;      // viscosity limiter for the Frictional model (required for stability)

alphaSmall      alphaSmall [ 0 0 0 0 0 0 0 ] 1e-5;  // minimum volume fraction (phase a) for division by alpha

// ************************************************************************* //
//Relative velocity parameters
relativeVelocity
	{
		turbulentDispersion		false;	//Flag to include turbulent dispersion force
		shearInduced			true;	//Flag to include shear induced self-diffusion
		nWCdCorrectors			10;		//No. of W-CD coupling loop iterations

	}
